app/Controllers/API/User/MenuController.php

    public function index()
    {
        $keyword = $this->request->getGet('keyword');

        if ($keyword) {

            $menus = $this->menuModel
                ->like('nama_menu', $keyword)
                ->orLike('ket', $keyword)
                ->findAll();

        } else {

            $menus = $this->menuModel->findAll();
---
SELECT *
FROM `menu`
WHERE `nama_menu` LIKE '%Snack%' ESCAPE '!'
OR  `ket` LIKE '%Snack%' ESCAPE '!'
SELECT *
FROM `menu`