app/Controllers/API/User/OrderController.php

    public function index()
    {
        $orders = $this->orderModel
            ->select('orders.*, menu.nama_menu, menu.harga, menu.Sampul')
            ->join('menu', 'menu.id_menu = orders.menu_id')
            ->orderBy('orders.created_at', 'DESC')
            ->findAll();
---
SELECT `orders`.*, `menu`.`nama_menu`, `menu`.`harga`, `menu`.`Sampul`
FROM `orders`
JOIN `menu` ON `menu`.`id_menu` = `orders`.`menu_id`
ORDER BY `orders`.`created_at` DESC