app/Controllers/API/User/PasswordResetController.php

SELECT *
FROM `users`
WHERE `email` = 'anesa8993@gmail.com'
INSERT INTO `password_resets` (`email`, `token`, `created_at`) VALUES ('anesa8993@gmail.com', 'be04f69d38feaaeeb45ad66d3c71d445bb87cf913bbfb7d700c5fff50e96bf26', '2026-06-10 11:13:45')
---
    public function sendLink()
    {
        $email = $this->request->getVar('email');

        if (!$email) {
            return $this->responseHasil(400, false, 'Email harus diisi');
        }

        // cek user
        $user = $this->db->table('users')
            ->where('email', $email)
            ->get()
            ->getRow();

        if (!$user) {
            return $this->responseHasil(404, false, 'Email tidak ditemukan');
        }

        // generate token
        $token = bin2hex(random_bytes(32));

        // simpan token
        $this->db->table('password_resets')->insert([
            'email'      => $email,
            'token'      => $token,
            'created_at' => Time::now()
        ]);

SELECT *
FROM `password_resets`
WHERE `token` = 'ac42f9014bf8771f3448bd9a79646adf54f227c6740afc6b0d199aad6c6eee84'
UPDATE `users` SET `password_hash` = '$2y$10$pmisgS70i/IezY1Y4ZDq9u2d8/KW3wpyj1VNnwl2/vNJyes8cnS2e'
WHERE `email` = 'anesa8993@gmail.com'
DELETE FROM `password_resets`
WHERE `token` = 'ac42f9014bf8771f3448bd9a79646adf54f227c6740afc6b0d199aad6c6eee84'
---
    public function resetPassword()
    {
        $token    = $this->request->getVar('token');
        $password = $this->request->getVar('password');
        $confirm  = $this->request->getVar('confirm_password');

        if (!$token || !$password || !$confirm) {
            return $this->responseHasil(400, false, 'Semua field wajib diisi');
        }

        if ($password !== $confirm) {
            return $this->responseHasil(400, false, 'Konfirmasi password tidak cocok');
        }

        $resetToken = $this->db->table('password_resets')
            ->where('token', $token)
            ->get()
            ->getRow();

        if (!$resetToken) {
            return $this->responseHasil(404, false, 'Token tidak valid atau sudah digunakan');
        }

        // update password
        $this->db->table('users')
            ->where('email', $resetToken->email)
            ->update([
                'password_hash' => password_hash($password, PASSWORD_DEFAULT)
            ]);

        // hapus token
        $this->db->table('password_resets')
            ->where('token', $token)
            ->delete();