app/Controllers/API/User/UserLoginController.php

SELECT *
FROM `users`
WHERE `email` = 'anesa8993@gmail.com'
OR `username` = 'anesa8993@gmail.com'
---
    public function login()
    {
        $email    = $this->request->getVar('email');
        $password = $this->request->getVar('password');

        $db = db_connect();

        $user = $db->table('users')
            ->where('email', $email)
            ->orWhere('username', $email)
            ->get()
            ->getRowArray();

SELECT `auth_groups`.`name`
FROM `auth_groups_users`
JOIN `auth_groups` ON `auth_groups`.`id` = `auth_groups_users`.`group_id`
WHERE `auth_groups_users`.`user_id` = '8'
---
        }

        // CEK ROLE USER
        $role = $db->table('auth_groups_users')
            ->join(
                'auth_groups',
                'auth_groups.id = auth_groups_users.group_id'
            )
            ->where('auth_groups_users.user_id', $user['id'])
            ->select('auth_groups.name')
            ->get()
            ->getRow();