app/Controllers/API/User/UserProfileController.php

SELECT *
FROM `users`
WHERE `users`.`id` = '8'
---
    public function index($id = null)
    {
        $user = $this->userModel->find($id);